[
  {
    "date": "2025年11月10日(月)",
    "title": "パレクイズ2(仮)プロジェクトスタート",
    "body": "今日はパレデミア学園の初配信からちょうど半年である。記念配信を行っている寮生が散見される。パレクイズの公開は2025年6月23日だった。パレクイズも半年を目処にリニューアルしたいと思い立った。基本的な方針は次のとおりである。\n・より配信でプレイしやすいようにする\n・顔当て/名前当て以外のクイズを作る"
  },
  {
    "date": "2025年11月11日(火)",
    "title": "前作パレクイズの反省点1",
    "body": "パレクイズは画面を狭くすると縦スクロールが発生してしまうのが最大の問題点だと感じている。これはいわゆるレスポンシブデザインというもので、スマホ画面のような横幅が狭いブラウザでは縦長レイアウトにしているためである。結果、配信では問題と回答選択肢の間をスクロールで往復しなければならず、見づらい配信になってしまっていた。縦型配信なら全画面をゲーム画面にすれば解決するが、実際はタレントの姿を下半分に配置するため、ゲーム画面は縦長には配置されないのである。"
  },
  {
    "date": "2025年11月12日(水)",
    "title": "画面サイズ検討",
    "body": "狭い画面でのスクロール問題を解決するために、パレクイズ2(仮)ではゲーム画面は基本的に正方形にすることにした。そして画面サイズが変わってもそれに合わせて各要素が拡大縮小するようにすればレイアウトが崩れることは無いだろう。"
  },
  {
    "date": "2025年11月13日(木)",
    "title": "前作パレクイズの反省点2",
    "body": "元々パレクイズは大量の問題を効率よく進めていくことを念頭に置いているため、回答したら数秒後に自動的に次の問題が表示される仕様になっている。しかし配信でパレクイズをプレイしている場合は、問題に出てくる寮生についての話をしながらとなるため、回答前にしかその寮生の話ができないことになる。この問題への対処が求められる。"
  },
  {
    "date": "2025年11月14日(金)",
    "title": "回答後の動作検討",
    "body": "回答後の動作について、次のようにすることにした。\n・回答後は次の問題に進むボタンを押させる\n・前の問題に戻れるボタンを設置\nこれによって回答後も話を続けられ、先に進んだ後に過去の問題を見に行くこともできる。"
  },
  {
    "date": "2025年11月17日(月)",
    "title": "通常問題作成開始",
    "body": "パレクイズ2(仮)では従来の顔当て・名前当てを踏襲しつつ、それとは別に4択の通常問題を出題する。例えば「七音うらが得意な楽器は？」のような問題である。実際に問題を作ってみないとわからないことも多いため、早速問題作成を開始する。"
  },
  {
    "date": "2025年11月18日(火)",
    "title": "通常問題の傾向について",
    "body": "通常問題は大体次のようなパターンや状況があることがわかった。\n・問題文がテキストのみ または テキスト+画像\n・回答選択肢がテキスト または 寮生\n・回答選択肢が寮生のときに容姿が見えていると都合が悪い場合がある\n・回答選択肢が寮生のときは正答以外は誰でもいいことが多い\nまた、その問題と答えが正しいことを示すために、証拠の画像や情報元のリンクを表示させる必要がありそうである。これらに対応できるような形でスプレッドシートに問題を追加している。"
  },
  {
    "date": "2025年11月19日(水)",
    "title": "通常問題作成難航中",
    "body": "100問を超えたくらいからだんだん問題作成が難しくなっている。安易な問題の量産は避けたいし、あまりにマニアックな問題は避けたい。寮生ごとに問題数の方よりが生じるのもよろしくない。まずは各寮生ごとに最低2問は用意する方向で進めている。\n断片的な特徴から寮生を当てるパターンの問題が、問題作成が容易で回答に深い知識は不要にも関わらず難易度が高い。見た目の特徴＋特技のようにすればその人の特技も知ることができる。そういうパターンの問題を色々追加してみよう。"
  },
  {
    "date": "2025年11月20日(木)",
    "title": "ゲームモード構成検討",
    "body": "ゲームモード構成で悩んでいる。現在想定しているものは次の通り。\n・顔当て: 出題範囲(寮ごと・すべて) × 難易度(普通・同じ髪色・シルエット)\n・名前当て: 出題範囲(寮ごと・すべて) × 難易度(普通・同じ髪色・シルエット)\n・通常問題: 出題範囲(寮ごと・すべて)\n\n初級・中級・上級の3モードを作り、顔当て・名前当て・通常問題をランダムに混ぜて出題。出題範囲と問題数を選択させる方向で進めることにした。"
  },
  {
    "date": "2025年11月21日(金)",
    "title": "ゲーム名をどうするか",
    "body": "そろそろパレクイズ2(仮)ではなく正式なゲーム名を決めたい。\n「パレクイズ」は公式チャンネルのクイズ番組と被るため、パレクイズ2にはしたくない。また、最近はパレデミア学園の略称として「パレ学」が浸透しつつあるため、「パレ」ではなく「パレ学」を使いたい。ChatGPTさんと相談しながら色々と考えた結果、「パレ学マスター」とすることにした。ちなみに別案は「パレ学学力テスト」「パレ学検定」「パレ学深堀りクイズ」「パレ学寮生理解度チェック」などである。"
  },
  {
    "date": "2025年11月24日(月)",
    "title": "Claude Opus 4.5登場",
    "body": "GitHub CopilotでClaude Opus 4.5が使えるようになった。このAIはパレクイズを製作したAIであるClaude Sonnet 4の後継(Claude Sonnet 4.5)の上位版(つまり従姉妹のようなもの)である。性能は現行のAIの中では最高レベルである。現在は試用期間であり12/5までは安く使うことができる(その後はお値段3倍)。Claude Opus 4.5を使ってパレ学マスターのプロトタイプ版を作成し、その後はClaude Sonnet 4.5を使うことにした。"
  },
  {
    "date": "2025年12月3日(水)",
    "title": "パレ学2期生募集開始",
    "body": "2期生の募集が始まった。2期生も60名らしい。パレ学マスターも当然2期生に対応する。まずは寮生一覧と顔名前当てに対応することになるだろう。2期生モードを作るか混ぜてしまうかは要検討である。1期生と2期生がそれぞれ先輩後輩の顔と名前を覚えるためにパレ学マスターが役立ってくれると幸いである。"
  },
  {
    "date": "2025年12月5日(金)",
    "title": "Nano Banana Pro参戦",
    "body": "GoogleのGeminiが使用している画像生成AIであるNano Banana Pro(2025年11月20日リリース)でいい感じの画像が作れる事に気付いた。背景画像・各種UIのパーツなどを生成してもらって組み込むことにする。Nano Banana Proの存在に2週間も気付かなかったなんて・・！ それにしてもClaude Opus4.5といここ最近の生成AIの進化が著しい。"
  },
  {
    "date": "2025年12月11日(木)",
    "title": "パレクイズ配信",
    "body": "第2回投票イベント開始。桜庭羽奈が配信でパレクイズをやっていた。縦スクロールが発生するのはやはり好ましくないことを再確認。未だにプレイしてもらえるのは嬉しい限りである。問題に松本Pが登場して驚いていた。この件の経緯については黙秘する。"
  },
  {
    "date": "2025年12月12日(金)",
    "title": "ゲーム画面の縦横比再考",
    "body": "実際にゲーム画面を作成してみたところ、正方形の画面で4択のクイズゲームを作る場合、各要素の配置が非常に難しいことに気付いてしまった。やはり通常のゲームと同様に横長の4:3のゲーム画面に切り替えることにした。そうするとスマホなどの縦画面ではゲーム画面が狭くなってしまう。文字サイズが小さくなりすぎないか、余白をどうするのかなどを考える必要があるだろう。理想としては横画面を強制することだが、ウェブゲームでそれは可能だろうか？"
  },
  {
    "date": "2025年12月14日(日)",
    "title": "ゲーム構成再考・アチーブメント作成",
    "body": "Nano Banana Proを使用してアチーブメント(実績解除するともらえる特典)の画像作成を行った。メダルやトロフィーなどの構成を考えながら作成していく過程で、ゲームモード構成を再考した。最終的に次のようにすることを決定した。\n・入門試験: 顔名前当て(各寮・すべて), 基本問題(15問)\n・実力試験: 顔名前当て上級(各寮・すべて), 深堀り問題(10問・30問・50問・100問)\n・マスター試験: 顔名前当て超級(各寮・すべて), 超深堀り問題(10問・30問・50問・100問)"
  },
  {
    "date": "2025年12月15日(月)",
    "title": "『ぱ』Tシャツ販売開始",
    "body": "クリスマスグッズ販売開始。そして『ぱ』Tシャツ販売開始。なぜこのTシャツを販売することになったのか？寮生たちがTシャツに言及していたので早速問題に追加した。\n深堀り問題・超深堀り問題は10問・30問・50問・100問 それぞれでパーフェクトならアチーブメントをもらえるようになっている。ゲームの実装と並行して問題作成を進めているが、まだ問題数がそれぞれ67問・81問しかない。問題を増やさなければ。"
  },
  {
    "date": "2025年12月16日(火)",
    "title": "問題募集",
    "body": "亀城ちかりが『ぱ』Tシャツを着て配信をしていた。\n最近問題作成に時間を取られすぎて実装がなかなか進まない。Googleフォームを使用してリスナー及び寮生から募集することにして、実装に集中する。解説ダイアログに問題提供者の名前を載せたいけれども、なりすましを防げないため断念。 今後は何か載せたい問題を思いついたときだけ問題作成する方針にした。"
  },
  {
    "date": "2025年12月17日(水)",
    "title": "顔名前当て超級は難しい",
    "body": "アチーブメントのテストを兼ねて顔名前当てをテストプレイ。超級顔名前当て(すべて)がなかなかパーフェクトを出せなくて愕然とした。似た髪型を選択肢に出すようにしたのが思いのほか効いているようだ。5回目くらいでパーフェクト達成。"
  },
  {
    "date": "2025年12月23日(火)",
    "title": "リリース予定日について",
    "body": "リリース予定日については当初から年末を想定していた。第2回投票イベントが12月29日の23:59までなので、それが終わってからリリースが無難だろう。ということで12月30日の0時以降にリリースすることとする。とはいえこの時点で既にURLを知っていれば普通にプレイできる状態なので、あとは告知するだけである。前作パレクイズのときは公式Xが告知してくれたが今回はどうなるだろうか。こっそりとjig.jp非公式Wikiに載せるか、誰かのマシュマロに密告するか、前作にリンクを追加するか。うーん。"
  },
  {
    "date": "2025年12月24日(水)",
    "title": "PWA対応",
    "body": "Android端末で動作確認をしたところ、横画面では上下にバーが表示されて画面が非常に狭くなってしまうことがわかった。これを解消するためにウェブアプリを通常のアプリのようにするPWAという技術を使うことにした。これはウェブページをホーム画面に追加することで、通常のアプリと同じようなアイコンが表示され、そのアイコンから起動すると全画面表示などができるというものである。AndroidでPWA化することに成功。アイコンは『ぱ』にした。"
  },
  {
    "date": "2025年12月25日(木)",
    "title": "縦画面対応",
    "body": "iPhoneでもPWA対応でPWAアプリインストールを強制して必ず横画面にできる・・と思っていたが、そう簡単な話ではないようだ。iPhoneではインストールボタンを出すことができず、PWA化しても横向き強制ができなかった。苦肉の策として簡易的な縦画面対応を行うことにした。ゲーム画面は画面上部に4:3で表示、大きく空いた画面下部には談話室と寮生1名を表示し、画面全体を見たときにパレ学マスターのゲーム配信を行っているような見た目にした。寮生が静止画では面白くないので微妙に動くようにしてみた。これをそのまま配信に使用してもらってもいいし、談話室だけ表示するようにしてLive2Dを重ねて配信してもらってもよい。"
  },
  {
    "date": "2025年12月26日(金)",
    "title": "横画面について",
    "body": "PWA対応や縦画面対応のために色々と手を入れた結果、なぜかAndroidのブラウザの横画面で下にバーが出てしまう問題が解消した。PWAで全画面のほうがプレイしやすいので、お好みでどちらかを使用してもらえればよいだろう。と思ったら、AndroidではJavaScriptで全画面表示が可能だった。タイトル画面に全画面ボタンを追加した。今までの苦労は一体何だったのか？"
  },
  {
    "date": "2025年12月27日(土)",
    "title": "隠し要素をどうする？",
    "body": "前作パレクイズには隠し要素が色々と入っていた。これはリリースタイミングをパレ学運営に委ねており、リリース待ちの暇を持て余して色々と追加実装を行った結果である。今作は問題作成にかなりの時間を取られていることもあり、多くの隠し要素を入れる余裕は無い。なのでスタッフロールと開発日誌のみ実装することにする。AIは暴走しない。物足りないだろうか？"
  },
  {
    "date": "2025年12月28日(日)",
    "title": "パレ学MBTI",
    "body": "なんと飛渡ココがパレ学のMBTIをまとめてくれていた。さっそく寮生詳細に載せることにした。スタッフロールにSpecial Thanksとして飛渡ココを載せた。\n『ぱ』Tシャツを買うかどうか迷っている。受注期限は投票イベント終了と同じ12月29日の23:59である。"
  },
  {
    "date": "2025年12月29日(月)",
    "title": "リリース前の追い込み",
    "body": "今日は最終的な確認のためにテストプレイを行っている。寮生一覧で灯野ぺけ。のファンネームが「ぺこのこ」になっているのを見つけてしまった！正しくは「ぺけのこ」である。思い返せばぺけまるは入学当初から随分とひどい目にあってきたように思う。ニコニコ超会議では「どん底提灯系VTuber」になっていたり、公式番組では苗字が誤字っていたり、マイクラのやり過ぎで先生に怒られたり、オリジナルソングイベントで僅差で入賞を逃したり、犬丸なでこに食べられたり、最近では配信中にBANされたり・・。色々と話題には事欠かないのだが、クイズとなると載せられるものは限られる。\n\nそして、先日の開発日誌で隠し要素を入れる余裕はないと書いたものの、やっぱりなにか物足りなくなってしまった。勢いで実装したので探してみてほしい。"
  },
  {
    "date": "2025年12月30日(火)",
    "title": "パレ学マスターリリース",
    "body": "第2回投票イベントが終わり、パレ学マスターのリリース予定日となった。寮生やリスナーからどのような反応があるのか、怖いような楽しみなような、複雑な気分である。"
  }
]