{
  "ss_title": "『ぱ』の衝撃、あるいは100kgの誤算",
  "chapters": [
    {
      "title": "序章：クゥ寮のざわめき",
      "body": "2025年12月15日、月曜日。 パレデミア学園の公式ストアに、その異物は音もなく現れた。\n\n最初に気づいたのは、ネットの海を漂うのが日課である朧月ひかるだった。彼女はクゥ寮の談話室のソファで、何気なくタブレットをスクロールさせていた手を止めた。 「……ねえ、みんな。ちょっと画面見て」 その声に反応して、こたつでみかんを食べていた神童めしあが顔を上げる。 「んー？ ひかるちゃん、また面白いネットミーム見つけたの？」 「ううん、違うの。これ……うちの公式ストア」 ひかるが指差した画面には、黒いTシャツの胸元に、デフォルメされた白いゴシック体で『ぱ』とだけ書かれた商品が表示されていた。\n\n「……『ぱ』？」 めしあの隣で種まき（という名の家庭菜園の手入れ）から戻ったばかりの畑スイカが覗き込む。 「これ、スイカの種よりシンプルだねぇ」 「いや、シンプルすぎるだろ！」と、すかさずツッコミを入れたのは、脊髄反射で話すことに定評のある肇明日空だ。 「これ商品？ バグじゃなくて？」 「これなら……」ひかるが不敵に笑う。「ふふん、わたしならパワポを使ってもっとダサくできる自信あるけどね！」\n\nその騒ぎを聞きつけ、ゲーミングPCに向かっていた風野かなめがヘッドホンをずらした。 「ん、なになに？ 人狼ゲームの役職公開？」 「いや、かなめちゃん、どう見てもTシャツだよ。……でも、この配置」 そこに、分厚い眼鏡をかけたシグマ・イングラムがスッと現れ、画面を凝視する。 「ふむ……。この『ぱ』の配置、黄金比から微妙にズレている。これは人類オタク化計画へのアンチテーゼか、あるいは高度な暗号……」 「シグマっち、考えすぎじゃない？」 呆れたように笑ったのは艶島カオルだ。彼女はスッと姿勢を正すと、急に焦ったような早口でまくし立てた。 「『あーもう！ 納期ヤバい！ デザイン思いつかねぇ！ ……ええい、もうパッと出しちゃえ！』……っていう、運営さんのモノマネ～」\n\n「あはは、カオルちゃん似てるー！ ……似てるけど、笑えないよぉ」 桜庭羽奈が手を叩いて笑うが、その目は真剣に「いつかサンリオコラボでこれが出たらどうしよう」と考えているようだった。 その横で、瀬奈りるかがおっとりと口を開く。 「お水を飲みます……。落ち着いてください、きっとこれは徳川十五代将軍の……いえ、関係なさそうですね」 「りるかちゃん、流石にそれは無理があるよぉ」 桜雲ほわりがふわりと笑いながら、「でもこれ着て空中散歩したら、凧みたいに見えるかな？」と首を傾げた。\n\n「ふっ……『ぱ』か。私の存在を世に知らしめるには、少々インパクトが足りないが……」 彼方ルカが厨二病的なポーズで考察しようとすると、それまで麻雀卓の方にいた猫乃間うとがのっそりと近づいてきた。 彼女は画面の『ぱ』を見るなり、パッと表情を輝かせた。 「ぱぁ！ わし、これ好き……」 どうやらお布団のような安心感をその文字に見出したらしい。彼女はとろんとした目でみんなを見渡して言った。 「さっき配信でリスナーさんにこれ見せたら、『先生、寝てください』ってコメントきたんじゃ。……だから、ぱTみんなでお揃いで着ようね……」\n\n「ええっ、先生って運営さんのこと！？」と愛乃宮ゆめが慌てる。「でもお揃いはいいけど……ゆめはもっと、フリフリで可愛いのがいいな～❣️」 「私は、意外と嫌いじゃないぞ。機能性重視という感じで」 そう言って肉にかぶりついているのは山田スバルだ。 「スバルさんは何でも似合いそうですけど……」と、天透あわがクラゲのようにゆらゆらと近づく。「これ、海で見たら深海魚の目みたいに見えるかも……」\n\n談話室の隅では、麻雀を打っていた神童めしあが改めて牌を混ぜながら呟いた。 「うとちゃん、お揃いって言ってたけど……これ本当に売れるのかな？」 瀬奈りるか、そして卓に戻ってきた猫乃間うとと共に雀魂をプレイしていた面々も首を傾げる。 「『ぱ』……パレデミア学園の『ぱ』なのは分かるんですけど……」 その問いに答えられる者は、美技巧者なゲーミング女子たちの中にはいなかった。"
    },
    {
      "title": "第2章：ウィニー寮の芸術論争",
      "body": "一方、ウィニー寮の暖炉の前では、このTシャツを巡って高度な（？）芸術論争が勃発していた。\n\n「このフォント……ただのゴシック体ではないわ」 ローズ・ダマスクハートが、紅茶のカップ（中身はともかく）を片手に、モニターに映る『ぱ』を陶酔した瞳で見つめる。 「深淵なる闇（黒Tシャツ）に浮かぶ、一筋の光（白文字）。これぞ我々ウィニー寮のテーマ、ウェスタンゴシックの極致……！」 「え、ローズちゃん、それ本気で言ってる？」 花晴りらがノートPCでHPのソースコードを確認しながら冷静に返す。「受注期間は12月29日まで……。投票イベントに被せてきてるのが怪しいわね」\n\n「手書きじゃないのが解せぬ」 スケッチブックを広げた黒鋼亜華が不満げに言った。「私ならもっと、こう、味のある『ぱ』を書くのに。筆ペンで『波』とか『覇』とかさ」\n\nそんな弟妹たちの議論をよそに、長女である七扇ヲトメはスマホ画面とみんなの顔を交互に見比べ、目を白黒させていた。 「あの……弟妹たち？ 盛り上がっているところ申し訳ないのですけれど……『ぱTシャツ』とは？？？？ わたくし、何も知らない困惑のヲトメですの……」 状況に全くついていけていないお姉ちゃんに対し、藤森ちとせが縄跳びを持ってピョンと跳ね、ウィンクを飛ばした。 「ぱ！ 謎のTシャツのもり～😉」 「ちとせちゃん、説明になってないですわ……」\n\nその横で、スマホを握りしめて震えていたのは八重森ふゆのだ。彼女は画面に向かって、悲痛な叫び声を上げた。 「公式どうした？？？ 風邪で脳みそに菌でも入った？？？」 「ふ、ふゆのちゃん！？ 言い過ぎだよ！？」とりらが慌てるが、ふゆのは真剣な表情で続ける。 「だって、そうとしか思えないよ！ もちろん愛ゆえの発言だけど！ 心配なんだよ！」 彼女は乱れた呼吸を整えると、テーブルにタロットカードを展開した。 「……はぁ。占ってみるね。このTシャツの運命……」 静まり返る談話室。めくられたカードを見て、ふゆのが天を仰ぐ。 「……『愚者』の逆位置。無計画、そして『常識外れ』という意味が出てるよ」\n\n「無計画……まさに運営の所業」 緋月・ローズ・ブレイドが、記憶喪失の頭を押さえながら呟く。「私の失われた記憶にも、こんなTシャツはなかったはず……。もしかして、前世の呪い？」 「記憶になくても、記録には残るよ！ これ100万回再生いくかな？！」 久堂れしあが動画のサムネイルをイメージしている。「『【衝撃】公式が乱心したのでTシャツ買ってみた』……いける！」 「押忍！ このTシャツの白、空手着の白に通ずるものがあります！」 桜堂ねるがシュッシュッと正拳突きを繰り出した。「3Dモデルで着て形を披露したら、気合が入りそうです！」 「ねるちゃん、それは道着じゃないよ……」 七音うらがマリンバのマレットを回しながら苦笑する。「でも、リズムに乗って『ぱ、ぱ、ぱ』って演奏するのは楽しそう。どこでも寝れる私としては、寝巻きにしてもいいかな」\n\n「僕にはわからないよ！ なんで『ぱ』なのさ！ 『ま』でも『り』でもなくて！」 満力きぃが全力でツッコミを入れる。「面白枠No.1はクゥ寮の艶島カオル先輩かもしれないけど、このTシャツの面白さには勝てないよ！ 悔しい！」 「ふふ、きぃちゃん、落ち着いて」 水無瀬天が優雅にシーシャのパイプを揺らす。「煙のように掴みどころがない……それがこのTシャツの魅力かもしれないよ。ほら、よく見るとサメの目に見えてこない？」 「見えないよ！」 きぃのツッコミが暖炉の前で空しく響いた。"
    },
    {
      "title": "第3章：ミュゥ寮のバイブス",
      "body": "ミュゥ寮のメイクルーム（兼配信スタジオ）の反応は、より直感的かつ辛辣だった。\n\n「ちょ、これマジ？ ウケるんですけど！」 雛菊のんがスマホを見ながら爆笑している。「これ着てギャルメイクしたら、逆に新しくない？」 「わかるー！ っょっょマインド感じるわ～」 陰山アゲハが派手なネイルを見せつけながら、画面の『ぱ』を指差して言い放つ。 「このデザイン……イカれてやがるでしょ（誉め言葉）」\n\n「えー、あーしはパスかな。なんか野球のユニフォームっぽくないし」 新巻るろながポテトチップスを食べながら興味なさそうに言うと、鈴木沙透が紅茶を吹き出した。 「るろなちゃん、食べこぼし！ ……ていうか、まじめに考えてこれ12,000パレコインもしますよね？ シンプルすぎて原価率どうなってるんですか？」 その問いに答えたのは、DJコントローラーをいじっていた恋歌さわこだ。彼女はビートに乗せながら、真顔でツッコミを入れた。 「ほんまそれ。誰がこんなん買うねん（誉め言葉）」 「二人とも、口ではディスってるけど『誉め言葉』って付ければいいと思ってない？」 愛葉はながお菓子作りの手を止めて苦笑する。「まあ、12,000パレコインなら汚れてもいいエプロン代わりに買ってもいいかもだけど……」\n\nそこへ、提灯を揺らしながら灯野ぺけ。が割り込んできた。 「えー、でもさでもさ！ 『ぱ』より『ぺ』の方が字可愛くない？ ぺけまるの『ぺ』！」 「いや、そこ張り合うところ？！」と東雲アカリが笑いながら、「でもこれ着てテレビ出たら、MCの人に『何その服！』って絶対いじってもらえそうやな～」と関西弁で計算する。\n\nそんなカオスな会話の中、配信ブースから亀城ちかりが戻ってきた。彼女はタブレットをみんなに見せる。 「みんな見て！ 私、さっきの配信でバーチャル試着して着てみたんだ！」 画面の中では、ちかりが胸元にデカデカと『ぱ』と書かれたTシャツ（の画像データ）を重ねて、一生懸命に喋っていた。 『えっと、見てください！ 黒だから着痩せ効果もありますし！ 2000円とお手頃価格ですし！ ……す、すごく前衛的でカッコいいと思います！』 「ちかりちゃん……」 音海まいるがウルウルした瞳で見つめる。「すごく……頑張って褒めてるね……。まいるも北極で着て宣伝する！」 「ちかりちゃんは偉いなぁ。貯金が趣味なのに、ちゃんとお金を使おうとするなんて」 氷雨セイがソファで寝転がりながら感心（？）している。「まあ、昼寝の枕代わりにはなるかも」 「えっ、セイちゃん枕にしちゃうの！？ 柚はこれ着て歌いたい！ 3Dライブで！」 緋雨柚が元気に飛び跳ねる。\n\n「あ、でもこれ、夜に着ると危なくない？」 夜宵カレンが魔界の常識（？）で心配する。「闇に溶けて文字だけ浮くのじゃ。夜宵放送局で注意喚起するのじゃ」\n\nミュゥ寮の面々は、「買うか買わないか」で揺れ動いていた。 「イカれてる」と言いつつも、その「愛すべきクソダサさ」と「お手頃価格」に、ギャルたちの心は少しだけ惹かれていたのかもしれません。"
    },
    {
      "title": "第4章：バゥ寮のひらめき",
      "body": "そして、事態が動いたのはバゥ寮の中庭での会話だった。\n\n「ねえねえ、この『ぱ』って、何の『ぱ』だと思う？」 飛渡ココが、空を見上げながら（視線の先には飛行機雲があるかもしれない）問いかけた。「パレデミアの『ぱ』？ それとも……トトココの『コ』……は関係ないコト」\n\nその問いに、スマホを握りしめていた天透あわが叫んだ。 「聞いてよみんな！ 私がついさっき『Tシャツ欲しいな〜🥺』って呟いたら、公式からタイミングよく『ぱ-T出したる‼️』ってこれが出てきたの！」 「ええっ、あわちゃんの願いが叶ったってこと？」 犬丸なでこが目を丸くすると、あわは頬を膨らませて地団駄を踏んだ。 「そういうことじゃない‼️‼️‼️ ……あ、でも買います😼👍🏻❤️🩷💙💚」 「買うんだ！？」 夢ト見りんねがズッコケる。「あわちゃん、全肯定すぎるよ！」\n\nその様子を見ていた黄金つむぎが、小説家のような顔つきで眼鏡（はないが）をクイッと直した。 「ふふふ……あわちゃんの『肯定』。それがヒントです」 「ヒント？」 フローレ・ブランカが反応する。「オタク的深読み考察キタコレですか！？」 「はい。黒いTシャツは夜、つまり『Night』。そして『ぱ』は……『Party』の『Pa』です！ つまりこれは、私たちへの『ナイトパーティー』の招待状なのです！」 「パーティー！？」 あわが炭酸のように弾けた。「しゅわしゅわの飲み物がいっぱい出るやつ！？」\n\n「なるほど！ 私、魔法で会場をキラキラにしちゃうよ！ いつかコラボしたい魔法少女先輩も呼べるかな～」 采多しゆあが杖を振る真似をすると、堂下さとりがアイスを食べながら割り込んだ。 「どうしたさとり、びっくりさとり、パーティーで悟り！ ……紅白出場祝いの前祝いってコト！？」 「わあ、お肉出るかな？ フルーツも！」 音海まいる（ミュゥ寮から遊びに来ていた）が加わり、話はどんどん大きくなる。 「皆さんの笑顔が見られるなら、素敵なパーティーになりそうですわ」 璃乃瀬りあが微笑み、愛上オハナが「みんなでお花を飾ろうよ！ 植物園みたいに！」と提案する。 「えへへ、じゃあ私、まるちーずのみんなも呼べるか聞いてみる！」 雨海まるがスマホを取り出す。\n\n「Wait. 少し待って」 冷静な声を上げたのは、相栖るじゅだった。「ただのパーティーじゃないかも。運営がわざわざ『受注生産』にするなんて……これは、Tシャツ購入者限定の、超・豪華シークレットパーティーのチケットかもしれないわ」 「！！！」 その場にいた全員に電流が走った。\n\n「トトココ、わかっちゃったコト！ これ、焼肉パーティーのチケットだ！」 ココのその一言が、全寮の食いしん坊たちの魂に火をつけた。"
    },
    {
      "title": "第5章：全寮緊急サミット",
      "body": "その日の夜22時。 愛上オハナと堂下さとりがパーソナリティを務めるラジオ番組『IDOU RADIO（あいどぅーらじお）』の配信枠は、異様な熱気に包まれていた。 普段はゲストを1人迎えて3人で配信するスタイルだが、今夜はDiscordのボイスチャットに全寮生が接続可能という、前代未聞の特別体制が敷かれていた。\n\n「はい、というわけでね！ 『IDOU RADIO』～！ 今夜はどうしたさとり、お腹ぺこぺこさとり！ パーソナリティの堂下さとりでーす！」 「みなさんこんばんは～！ こんな夜遅くに集まってくれて、みんな本当にえらいね～！ 愛上オハナです🌷」\n\nさとりの軽快なタイトルコールと、オハナの全肯定ボイスで幕を開けた緊急会議。 議題はただ一つ。『ぱTシャツ、実は焼肉パーティーのチケット説』についてである。\n\n「えー、コメント欄もすごいことになってますけども。早速、各寮の代表者から意見を聞いていきましょうか。まずはクゥ寮の頭脳、シグマさん！」 さとりが振ると、SEのようなノイズと共にシグマ・イングラムの声が響いた。 「こちらシグマだ。単刀直入に言おう。確率的に見て、運営が何の意味もなく『ぱ』という文字だけをプリントしたTシャツを販売する可能性は極めて低い」 シグマはキーボードを叩く音を響かせながら続ける。 「12月は予算消化の時期だ。そして我々は成長期。運営は考えたはずだ。『ぱ』……つまり『Party』を開催し、経費で我々の腹を満たしつつ、結束力を高める『人類焼肉化計画』を！」 「おおー！ さすがシグマちゃん、説得力が違うね～！」オハナが拍手する。\n\n「ちょっと待ったー！」 次に手を挙げたのは、ミュゥ寮の鈴木沙透だ。 「まじめに計算しましたけど、このTシャツ2000円ですよね？ 原価を差し引いても、仮に1000枚売れたとしたら……あそこの高級焼肉店の『極上牛タン』が、一人あたり5人前はいける計算になります！」 その具体的な数字と「牛タン」というパワーワードに、チャット欄が爆発した。\n\n猫乃間うと: 『牛タン……！ わし、牛タン食べたい……！ 起きた！』 神童めしあ: 『救世主（メシア）……！』 新巻るろな: 『お魚も焼きたい！』 亀城ちかり: 『貯金崩してTシャツ追加購入します！！！』\n\n「みんな落ち着いて！ まだ確定じゃないから！」 さとりが制止するが、その声も震えている。「でも、ウィニー寮はどう？ 芸術的観点からは？」 「はいはい、ウィニー寮代表、黒鋼亜華だよ～」 のんびりとした声が割り込む。「私ね、気づいちゃったの。このTシャツの黒い余白……これって、『食べたお肉の部位を書き込むためのキャンバス』なんじゃないかなって」 「なるほど！？ 食べた分だけ白くなっていくシステム！？」 「それに、私のサイン入りTシャツなら抽選でプレゼントだけど、これならみんなが主役になれるでしょ？」 「亜華ちゃん、発想が素敵だね～！ お肉への愛を感じるよ～！」オハナが感心する。\n\nここで、バゥ寮から相栖るじゅがマイクをオンにした。 「フィットネスの観点からも言わせて。良質なタンパク質の摂取は、アイドルの身体作りには不可欠よ。このタイミングでの焼肉……運営は私たちのコンディションを気遣ってくれているのよ、きっと」 「さすがるじゅちゃん！ 説得力がダンベル級だね！」さとりが乗っかる。\n\nそして、最後に重低音のような声が響いた。 「……肉と聞いて、瞑想をやめて飛んできた」 クゥ寮の山田スバルである。 「生肉……いや、焼いてもいい。俺は食う。このTシャツがチケットだと言うなら、俺は今すぐ3枚重ね着してもいい」 「スバルさんが言うと、もう決定事項に聞こえてくるよ～！」\n\n会議は最高潮に達した。 飛渡ココが「トトココ、タレは甘口派！」と宣言し、肇明日空が「わさび醤油も捨てがたい！」と叫ぶ。 天辻ゆらぐが「お酒……はまだ飲めない子もいるから、コーラで乾杯だね……」と呟き、神童めしあが「コーラ！！」と反応する。\n\n「よし、みんなの気持ちは一つだね！」 さとりが机（と思われるもの）をバンと叩いた。 「この『ぱ』は、パレデミア大忘年会、兼、焼肉パーティーの『ぱ』！ それ以外ありえない！」\n\n「じゃあ、誰が運営さんに確認しに行く？」 オハナが問いかけると、一瞬の静寂の後、一人の勇者が名乗りを上げた。 「あたしが行くぜ！」 クゥ寮の艶島カオルだ。 「7月に『100kg超えスタッフ厳選 グルメ争奪戦』を仕切った、あのスタッフさんなら話がわかるはずだ！ だって100kgだぜ！？ お肉の気持ちが一番わかるのは彼しかいない！」\n\n「おおー！！ カオルちゃん、頼んだよ～！」 「任せとけ！ 0.1秒で説得してくるわ！」\n\nこうして、全寮生の胃袋と期待を背負った代表団（カオル、シグマ、沙透、スバル、るじゅ）が結成され、運命のバーチャルオフィスへと突撃することになったのである。"
    },
    {
      "title": "第6章：100kgの真実",
      "body": "運営スタッフのデスク。そこには、7月の「100kg超えスタッフ厳選 グルメ争奪戦イベント」を企画した、あの巨漢スタッフが座っていた。 彼は片手にピザ（Lサイズ）を持ちながら、モニターに映る「Tシャツ受注数」を見て首を傾げていた。\n\n「（……なんでこんなに売れてるんだ？）」\n\nそこへ、寮生たちからの通知が嵐のように届く。 『運営さん！ Tシャツ買いました！ 焼肉はいつですか！？』 『お肉！ お肉！』 『A5ランクでお願いしますのじゃ！』\n\nそして、ひときわ切実なメッセージが画面を埋め尽くした。 猫乃間うと: 『牛タン……厚切りの牛タン……わし、待ってる……』\n\nスタッフはピザを落としそうになった。 「や、焼肉……？ 牛タン……？」\n\n彼は震える指でキーボードを叩き、寮生たちのボイスチャットに接続した。 「あー、テステス。スタッフです。……あのみんな、どういうこと？」\n\n代表してシグマ・イングラムが、予算消化と結束力強化のための「人類焼肉化計画」について論理的に（希望的観測を9割9分含めて）説明する。 スタッフはそれを聞き、深い、深～い溜め息をついた後、意を決して口を開いた。\n\n「……ごめん、みんな。焼肉はない」\n\n『ええええええ！？』 全寮生の絶叫が響き渡る。 特に猫乃間うとの「タンがぁぁ……」という悲痛な声は、涙を誘うものがあった。\n\n「じゃあ、この『ぱ』は何なんですか！？」 満力きぃが食い下がる。「僕たちのパッションの『ぱ』じゃないんですか！？」\n\nスタッフは言いにくそうに、しかし正直に告白した。 「実は……俺、最近さらに太っちゃってさ。市販のTシャツがキツいんだよ」\n\n『……はい？』\n\n「で、公式ストアでXLサイズを作れるかテストしようと思って。デザイン考えるのが面倒で……手元にあったパンの袋を見て『ぱ』って打っちゃったんだ。そしたら誤操作で公開されちゃって……」\n\n沈黙が流れる。 恐ろしいほどの静寂が、ボイスチャットを支配した。\n\n桜庭羽奈が、信じられないという声で呟いた。 「それだけ……？ サンリオコラボとか、伏線とかじゃなくて……？」\n\n「うん。……あ、でも！ サイズはXLまであるから！ みんなでダボッと着て、俺とお揃いコーデしよ？」\n\nその瞬間、Discordの通話から一人、また一人と退出音が響いた。 彼方ルカが「解散だ、カナタミ」と捨て台詞を吐き、神童めしあは「コーラ……」と力なく呟いて通信を切った。 残されたのは、悪気なくピザを齧るスタッフと、行き場のない『ぱ』の文字だけだった。"
    },
    {
      "title": "終章：それでも『ぱ』は残る",
      "body": "騒動は収束した。 焼肉パーティーの夢は潰えたが、意外なことに『ぱ』Tシャツのキャンセルは少なかった。 「ネタとしておいしい」「部屋着にはいい」というVTuberとしての性（さが）が勝ったのかもしれないし、単にキャンセル手続きが面倒だったのかもしれない。\n\n数日後、配信でTシャツを着た灯野ぺけ。が、リスナーから「そのTシャツ何？」と聞かれ、こう答えていた。 「これはね、運営さんの『ぱ』ツパツのお腹を守るための聖なる衣なんだよ！ ご利益あるかもよ！」\n\n風野かなめは「人狼で言ったら『狂人』みたいなアイテムだね。着てると狂気が増すよ」と笑い、黄金つむぎは「これはこれで、日常系のコメディ小説になりそう！ タイトルは『転生したら運営のサイズミスだった件』！」と筆を執った。\n\n月百ぷかりはXLサイズをワンピースのように着て「おふとんみたい～」と喜び、フローレ・ブランカは「運営推しとしてはマストバイアイテムです！ 100kgスタッフさんの概念コーデです！」と逆に熱弁を振るっていた。 そして、亀城ちかりは「貯金崩して買っちゃったからには、元を取るまで着倒すぞ！ パジャマにもレッスン着にもする！」と、誰よりも愛用していた。\n\nそして、病気療養中の松本Pが復帰した時、彼は学園中が謎の『ぱ』Tシャツで溢れている光景を目にすることになる。\n\n「……なんだこれ？」\n\nその問いに答える者は、もう誰もいなかった。ただ、100kg超えのスタッフだけが、ゆったりとしたTシャツを着て、満足そうにピザを食べていたという。\n\n（おしまい）"
    }
  ]
}